# -*- orgstrap-cypher: sha256; orgstrap-norm-func-name: orgstrap-norm-func--prp-1\.1; orgstrap-block-checksum: 85ede7c187eeefc6adc8bdcdef347d11162665416861fef60d04a20d91ef6599; -*-
# [[orgstrap][jump to the orgstrap block for this file]]
#+TITLE: git-share a git repository resolver

# FIXME this needs to be called before tangling can continue ... how safely ...
#+call: def-project-name-base() :var reset=(identity nil)

#+name: project-description-short
#+header: :results value drawer
#+begin_src elisp :exports results :eval no-export
"A git repository registration service and resolver."
#+end_src

#+RESULTS: project-description-short
:results:
A git repository registration service and resolver.
:end:

**** cl
Use =dexador= as our http client.
#+begin_src lisp :results none
(ql:quickload :dexador)
#+end_src

#+begin_src lisp :results drawer
(dex:post (concatenate 'string
                       "http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e"
                       "?remote=https://github.com/tgbugs/git-share.git"))
#+end_src

#+RESULTS:
:results:
"Register: git:e6cf3a391686a0b49171b9b195da88e81125bb1e -> https://github.com/tgbugs/git-share.git"
200
#<HASH-TABLE :TEST EQUAL :COUNT 4 {100184ACD3}>
#<QURI.URI.HTTP:URI-HTTP http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e?remote=https://github.com/tgbugs/git-share.git>
#<SB-SYS:FD-STREAM for "socket 127.0.0.1:56800, peer: 127.0.0.1:4242" {10090E1583}>
:end:

#+begin_src lisp :results drawer
(dex:get "http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e")
#+end_src

#+RESULTS:
:results:
"Id: git:e6cf3a391686a0b49171b9b195da88e81125bb1e -> ((git@github.com:tgbugs/git-share.git)
                                                     (https://github.com/tgbugs/git-share.git))"
200
#<HASH-TABLE :TEST EQUAL :COUNT 4 {10054BBCB3}>
#<QURI.URI.HTTP:URI-HTTP http://localhost:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e>
#<SB-SYS:FD-STREAM for "socket 127.0.0.1:56820, peer: 127.0.0.1:4242" {10054B9EA3}>
:end:

#+begin_src lisp :results drawer
(dex:get "http://localhost:4242/resolve/git:e6cf3a391686a0b49171b9b195da88e81125bb1e")
#+end_src

#+RESULTS:
:results:
"git@github.com:tgbugs/git-share.git"
200
#<HASH-TABLE :TEST EQUAL :COUNT 4 {1005667543}>
#<QURI.URI.HTTP:URI-HTTP http://localhost:4242/resolve/git:e6cf3a391686a0b49171b9b195da88e81125bb1e>
#<SB-SYS:FD-STREAM for "socket 127.0.0.1:56926, peer: 127.0.0.1:4242" {1005665813}>
:end:

**** bash/curl
#+header: :shebang "#!/usr/bin/env sh" :mkdirp yes
#+begin_src bash :var TEST_HOST="localhost" :results output :tangle ./test/test-curl.sh
time for i in {0..9999}; do echo $i; done | \
xargs -P15 -r -n 1 -- curl -s -X GET \
http://${TEST_HOST}:4242/git/e6cf3a391686a0b49171b9b195da88e81125bb1e -H 2>&1 > /dev/null
#+end_src

|  time | avg       |
|-------+-----------|
|   6.8 | 6.8072857 |
|   6.7 | 1469.0143 |
| 6.542 |           |
| 7.323 |           |
| 7.045 | slad      |
| 6.306 |           |
| 6.935 | slad      |
#+TBLFM: @2$2=vmean(@2$1..@>$1)
#+TBLFM: @3$2=(10000 / @2$2)

* Bootstrap :noexport:
#+name: orgstrap
#+begin_src elisp :lexical yes :noweb yes :results none
<<def-project-name-base>>

(defvar orgstrap-do-tangle nil "Override this for emacs --batch")

(defvar orgstrap-do-build nil "Override this for emacs --batch")

(defvar orgstrap-do-packages-system nil
  "Control whether to run code that fetches and installs external
dependencies. NOTE This implies `orgstrap-packages' t!")

;; TODO consider whether using an enumerate value might make more sense
;; e.g. orgstrap-deps '(nil :emacs :system) and then blocks could set
;; their requirements?
(defvar orgstrap-do-packages-emacs nil
  "Control whether to run code that fetchs and installs elisp packages.")

;; minimal reval

(unless (featurep 'reval)
  (defun reval-minimal (cypher checksum path-or-url &rest _alts)
    (let ((o url-handler-mode))
      (url-handler-mode)
      (unwind-protect
          (when (file-exists-p path-or-url)
            (let* ((buffer (find-file-noselect path-or-url))
                   (buffer-checksum (intern (secure-hash cypher buffer))))
              (if (eq buffer-checksum checksum)
                  (eval-buffer buffer)
                (kill-buffer buffer)
                (error "reval: checksum mismatch! %s" path-or-url))))
        (unless o
          (url-handler-mode 0)))))
  (defalias 'reval #'reval-minimal))

;; ow

(unless (featurep 'ow-min)
  (reval 'sha256 '3282d9328e05a12595ffc13e5afbeb3b3a76f1e3c45d50a53df39c2afd6ca341 "https://raw.githubusercontent.com/tgbugs/orgstrap/1e1fa08f9c1c059b393f737fcf19b55082bf660/ow-min.el"))

;; local defuns

(defun orgstrap---make ()
  "local function to run any extra steps required to build outputs"
  (let ((exec-path
         (cons (concat default-directory "bin")
               exec-path)))
    (concat
     "\nsbcl build:\n"
     (run-command "build-image-sbcl")
     "\necl build:\n"
     (run-command "build-image-ecl"))))

(defun orgstrap---make-not-quite ()
  "local function to run any extra steps required to build outputs"
  ' ; unfortunately the semantics of --eval and progn mean that we
  ;; can't use this approach easily because everything is read at
  ;; the same time so the namespaces for uiop: and ql: are missing
  (prog1 ;;concat
      ;;"\nsbcl build:\n"
      (orgstrap--with-block "build-image-sbcl"
        (let ((rbody (concat "(progn\n" body "\n)"))
              (print-escape-newlines nil))
          (message "%S" rbody)
          (run-command "sbcl"
                       ;;"--script"
                       "--noinform"
                       "--disable-ldb"
                       "--lose-on-corruption"
                       "--end-runtime-options"
                       "--noprint"
                       ;;"--no-sysinit"
                       "--no-userinit"
                       "--disable-debugger"
                       "--eval" rbody
                       "--eval" "(sb-ext:quit)")))
    "\necl build:\n"
    (orgstrap--with-block "build-image-ecl"
      ;; for some reason the script version of this works without issue
      ;; but this version can't find
      (let ((rbody (concat "(progn\n" body "\n)"))
            (print-escape-newlines nil))
        (message "%S" rbody)
        (run-command "ecl" "-q" "--norc" "--eval" rbody)))))

(defun orgstrap---system ()
  "Install system packages.
The simplest way to do this is to use a block for org babel language that can
be run as root. Unfortunately elisp does not work with :dir /su:: at the moment.

My general advice would be to specify system dependencies using the native
tooling for each package manager that you want to support. I suggest using
get-emacs.el.sh.ps1 as the basis for this since it can be run as root.
"
)
;; system packages go first in case elisp packages depend on them
(when orgstrap-do-packages-system
  (orgstrap---system))

(when (or orgstrap-do-packages-system orgstrap-do-packages-emacs)
  (orgstrap---packages))

(when (or orgstrap-do-tangle orgstrap-do-build)
  (org-babel-tangle)
  (when orgstrap-do-build
    (orgstrap---make)))

;; TODO org-babel-do-load-languages
(org-babel-do-load-languages
   'org-babel-load-languages
   '((lisp . t)))

;; TODO slime (needs reval) have to set inferior lisp etc
(condition-case nil
  (require 'slime)
  (error (package-install 'slime)))
#+end_src

#+name orgstrap-system
#+begin_src bash :dir /su::
id
#+end_src

#+RESULTS:
| uid=0(root) gid=0(root) groups=0(root) | 1(bin) | 2(daemon) | 3(sys) | 4(adm) | 6(disk) | 10(wheel) | 11(floppy) | 26(tape) | 27(video) |

